---
kind: method
id: M:Autodesk.Revit.DB.ImageExportOptions.#ctor
source: html/fa14ebd5-72be-c63f-fa9e-a84e33cd5567.htm
---
# Autodesk.Revit.DB.ImageExportOptions.#ctor Method

Constructs a new instance of the options class used to produce images.

## Syntax (C#)
```csharp
public ImageExportOptions()
```